#+TITLE:     Syllabus for 06-714 Surfaces and Adsorption
#+AUTHOR:    John Kitchin
#+EMAIL:     jkitchin@andrew.cmu.edu
#+DATE:      2013-01-14 Mon
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:

The current version of this syllabus will always be at https://github.com/jkitchin/surfaces-book/syllabus

* Instructors
Professor John Kitchin
DH A207F
412-269-7803
jkitchin@andrew.cmu.edu
Office hours by appointment

TA: Aaron Reinicker
areinick@andrew.cmu.edu
Office hours by appointment

** Textbook
We will not be using a textbook this semester. I will provide you with class notes and photocopies of reading materials. You can find the latest copies of notes at https://github.com/jkitchin/surfaces-book. It is not necessary to use git to keep up with the notes, but you may find it helpful.

** Classes
Classes held 11:30am to 1:20pm on Mondays and Wednesdays in SH214. See the end of the syllabus for notes about the class schedule. 

** Course description

This course will provide a survey of solid surfaces and gas-solid interactions. Topics include the structure and electronic properties of metal surfaces, the kinetics and thermodynamics of adsorption and desorption processes, and concepts in heterogeneous catalysis. The course emphasizes the application of recent experimental techniques in studying these problems. 

Numerical analysis of data is increasingly important in science. In this course we will have a focus on numerical analysis of data typically obtained in surface science. The primary tool used for this analysis will be the Python programming language and several scientific, numeric and plotting libraries. We will go over this in class.

** Course work

Your course grade will be primarily determined by your performance on problem sets, in class quizzes, a literature review project, and a course project. 

| category          | %wt |
|-------------------+-----|
| Problem sets      |  30 |
| Quizzes           |  30 |
| Literature review |  20 |
| Course project    |  20 |
|-------------------+-----|
|                   | 100 |
#+TBLFM: @>$2=vsum(@2..@-1)

** Grading
You should be transitioning into a young professional at this point. That means assignments are done professionally too. In addition to the technical correctness of your work, we will also be assessing the professionalism with which it is presented.

There will be a straight scale (no curve) so you will always know exactly what your grade is at all times. Each problem will be graded considering the approach used, the correctness of the answer, the neatness and quality of presentation, etc....  

"A" work has the following characteristics: The correct approach is used and the problem is set up correctly. The work is not over-simplified and it is easy to see it is done correctly. Any assumptions made were stated and justified. The answers are correct or only the most trivial errors are present, and were identified by the student. All of the correct units were used. The presentation is clear, logical, neat and in order. Error analysis was performed if appropriate. Any figures used have properly labeled axes with units, and a legend if there is more than one curve. Essentially everything that should have been done was done and done correctly. This is the kind of work an employer wants their employees to do, and the kind of work you will be promoted for doing.  

"B" work is deficient in one or more of the properties of "A" work. It might be basically right, but essential details are missing such as units, or the presentation is sloppy. You will get by with this kind of work, but you should not expect to be praised for it.  

"C" quality work is deficient in more than two of the properties of "A" work. You would probably not get fired for this kind of work, but you may be notified you need to improve and you should not expect any kind of promotion.  

"D" work is not considered acceptable performance. Repeat offenses could lead to the loss of your job.  

"R" work is totally unacceptable performance. You will be fired. 

Each problem will have a point value associated with it. The letter grade you get serves as a multiplier on that point value. The multipliers are:

| Lettergrade | multiplier |
|-------------+------------|
| A++         |          1 |
| A+          |       0.95 |
| A           |        0.9 |
| A-          |       0.85 |
| A/B         |        0.8 |
| B+          |       0.75 |
| B           |        0.7 |
| B-          |       0.65 |
| B/C         |        0.6 |
| C+          |       0.55 |
| C           |        0.5 |
| C-          |       0.45 |
| C/D         |        0.4 |
| D+          |       0.35 |
| D           |        0.3 |
| D-          |       0.25 |
| D/R         |        0.2 |
| R+          |       0.15 |
| R           |        0.1 |
| R-          |       0.05 |
| R--         |        0.0 |

At the end of the semester I will calculate what fraction of the possible points you have earned, and your grade will be based on this distribution: 

| 80% <= grade      | A |
| 60% <= grade < 80 | B |
| 40% <= grade < 60 | C |
| 20% <= grade < 40 | D |
| grade < 20%       | R |

** Course schedule
*** DONE [2013-01-14 Mon]
*** DONE [2013-01-16 Wed]
    CLOSED: [2013-02-04 Mon 09:20]
*** DONE [2013-01-21 Mon] MLK Day, NO CLASS
    CLOSED: [2013-02-04 Mon 09:20]
*** DONE [2013-01-23 Wed]
    CLOSED: [2013-02-04 Mon 09:20]
*** DONE [2013-01-28 Mon]
    CLOSED: [2013-02-04 Mon 09:20]
*** DONE [2013-01-30 Wed]
    CLOSED: [2013-02-04 Mon 09:20]
*** [2013-02-04 Mon] AES/XPS
*** [2013-02-06 Wed] SEM/TEM
*** [2013-02-11 Mon] Vibrational spectroscopy
*** [2013-02-13 Wed] Adsorption kinetics
*** [2013-02-18 Mon] Equilibrium adsorption
*** [2013-02-20 Wed] Thermal desorption
*** [2013-02-25 Mon] Tentative tour of Gellman surface science lab
*** [2013-02-27 Wed] Tentative tour of MSE microscopy lab
*** [2013-03-04 Mon] Literature Review presentations
*** [2013-03-06 Wed] Literature Review presentations
*** [2013-03-11 Mon] SPRING BREAK, NO CLASS
*** [2013-03-13 Wed] SPRING BREAK, NO CLASS
*** [2013-03-18 Mon]
*** [2013-03-20 Wed]
*** [2013-03-25 Mon]
*** [2013-03-27 Wed]
*** [2013-04-01 Mon]
*** [2013-04-03 Wed]
*** [2013-04-08 Mon]
*** [2013-04-10 Wed]
*** [2013-04-15 Mon]
*** [2013-04-17 Wed]
*** [2013-04-22 Mon] Guest lecture on Biosurfaces (tentative)
*** [2013-04-24 Wed] Guest lecture on Zetaspin (tentative)
*** [2013-04-29 Mon] Final project presentations
*** [2013-05-01 Wed] Final project presentations
